<?php

namespace Database\Seeders;

use App\Models\StarbucksStore;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class StarbucksstoreSeeder extends Seeder
{
    public function run(): void
    {
        $starbucks_stores = [
            [
                'name' => '大阪城公園店',
                'address' => '大阪府 大阪市中央区 大阪城 3-1 JO-TERRACE OSAKA',
                'lat' => 34.68975903060881,
                'lng' => 135.53223013243388,
            ],
            [
                'name' => '大阪城公園森ノ宮店',
                'address' => '大阪府 大阪市中央区 大阪城 3-9',
                'lat' => 34.683384466265146,
                'lng' => 135.53181804178755,
            ],
            [
                'name' => '谷町筋ＮＳビル店',
                'address' => '大阪府 大阪市中央区 谷町 2-2-22 ＮＳビル 1F',
                'lat' => 34.68656172622393,
                'lng' => 135.51757099576213,
            ],
            [
                'name' => '天満橋京阪シティモール店',
                'address' => '大阪府 大阪市中央区 天満橋京町 1-1 京阪シティモール',
                'lat' => 34.69030915002835,
                'lng' => 135.51651008596488,
            ],
            [
                'name' => 'ＯＢＰ松下ＩＭＰビル店',
                'address' => '大阪府 大阪市中央区 城見 1-3-7 松下 IMP ビル',
                'lat' => 34.69183122346711,
                'lng' => 135.5305559399396,
            ],
            [
                'name' => '淀屋橋 odona 店',
                'address' => '阪府 大阪市中央区 今橋 4-1-1 淀屋橋 odona B1F',
                'lat' => 34.69100186189843,
                'lng' => 135.5005360859649,
            ],
            [
                'name' => '北浜店',
                'address' => '大阪府 大阪市中央区 今橋 2-2-2 南都銀行大阪北浜ビル 1 階',
                'lat' => 34.69033035471832,
                'lng' => 135.50641244178746,
            ],
            [
                'name' => '御堂筋本町店',
                'address' => '大阪府 大阪市中央区 本町 4-2-12 野村不動産御堂筋本町ビル',
                'lat' => 34.683500376290205,
                'lng' => 135.50018512644567,
            ],
            [
                'name' => '堺筋本町店',
                'address' => '大阪府 大阪市中央区 本町 1-8-12 オーク堺筋本町ビル 1F',
                'lat' => 34.68400333194051,
                'lng' => 135.507127739939,
            ],
            [
                'name' => 'PMO EX 本町店',
                'address' => '大阪府 大阪市中央区 本町 3-1-10 PMO EX 本町 1 階',
                'lat' => 34.6838730965322,
                'lng' => 135.50293251110367,
            ],
            [
                'name' => '南御堂ビルディング店',
                'address' => '大阪府 大阪市中央区 久太郎町 4-1-15 南御堂ビルディング',
                'lat' => 34.680898749388575,
                'lng' => 135.5001392245973,
            ],
            [
                'name' => 'Olive LOUNGE 船場店',
                'address' => '大阪府 大阪市中央区 久太郎町 3-5-19 Olive LOUNGE 1 階',
                'lat' => 34.68145324913234,
                'lng' => 135.50091773801284,
            ],
            [
                'name' => 'TSUTAYA EBISUBASHI 店',
                'address' => '大阪府 大阪市中央区 道頓堀 1-8-19',
                'lat' => 34.66936631684464,
                'lng' => 135.50144985123674,
            ],
            [
                'name' => 'なんばウォーク店',
                'address' => '大阪府 大阪市中央区 千日前 1 なんばウォーク 5-1',
                'lat' => 34.667453151885844,
                'lng' => 135.5032152538211,
            ],
            [
                'name' => 'なんば南海通店',
                'address' => '大阪府 大阪市中央区 難波千日前 12-30 難波長和ビル 1 階',
                'lat' => 34.665264935631285,
                'lng' => 135.50209326731328,
            ],
            [
                'name' => 'なんば 御堂筋グランドビル店',
                'address' => '大阪府 大阪市中央区 難波 2-2-3 御堂筋グランドビル B1F',
                'lat' => 34.6676813581575,
                'lng' => 135.49976728249032,
            ],
            [
                'name' => 'なんば CITY 店',
                'address' => '大阪府 大阪市中央区 難波 5-1-60 なんば CITY',
                'lat' => 34.66383426113764,
                'lng' => 135.50161935196914,
            ],
            [
                'name' => 'なんばスカイオ 3 階店',
                'address' => '大阪府 大阪市中央区 難波 5-1-60 なんばスカイオ',
                'lat' => 34.66379591408096,
                'lng' => 135.5009909114929,
            ],
            [
                'name' => '大阪高島屋 地階西ゾーン店',
                'address' => '大阪府 大阪市中央区 難波 5-1-5 大阪高島屋',
                'lat' => 34.6637694405586,
                'lng' => 135.50089435196935,
            ],
            [
                'name' => 'エディオンなんば店',
                'address' => '大阪府 大阪市中央区 難波 3-2-18 エディオンなんば本店',
                'lat' => 34.66578198872737,
                'lng' => 135.5017983961491,
            ],
            [
                'name' => 'クリスタ長堀店',
                'address' => '大阪府 大阪市中央区 南船場 3 丁目 長堀地下街 4 号　 CRYSTA',
                'lat' => 34.67536449189623,
                'lng' => 135.5024371173087,
            ],
            [
                'name' => '北心斎橋店',
                'address' => '大阪府 大阪市中央区 南船場 3-11-10',
                'lat' => 34.67619802469129,
                'lng' => 135.50132874837436,
            ],
            [
                'name' => 'クリスタ長堀 ウエスト店',
                'address' => '大阪府 大阪市中央区 南船場 4 丁目 長堀地下街 7 号 クリスタ長堀',
                'lat' => 34.6754023383989,
                'lng' => 135.49839433847762,
            ],
            [
                'name' => '心斎橋パルコ店',
                'address' => '大阪府 大阪市中央区 心斎橋筋 1-8-3 心斎橋パルコ',
                'lat' => 34.67434610668592,
                'lng' => 135.50097051149328,
            ],
            [
                'name' => '心斎橋 BIG STEP 店',
                'address' => '大阪府 大阪市中央区 西心斎橋 1-6-14 BIG STEP',
                'lat' => 34.672376465677644,
                'lng' => 135.49874129719763,
            ],
        ];


        foreach ($starbucks_stores as $starbucks_store) {
            StarbucksStore::firstOrCreate($starbucks_store);
        }
    }
}
